; \file    main.s
; \author  Александр Смирнов
; \version 1.0.0
; \date    16.09.2022
; \brief   Программа на языке Ассемблер (ARM) для среды разработки Keil uVision 5.
;          Задача:
;          Дан массив однобайтовых чисел в прямом коде со знаком.
;          Начальный адрес - 0x20000000, конечный адрес - 0x20000010.
;          Начиная с адреса 0x20000020 записать сначала отрицательные числа
;          в дополнительном коде со знаком,
;          а затем положительные. Ноль не копировать.

            ; Секция с программой
            ; Обязательная секция
            AREA    PROGRAM, CODE, READONLY     ; Указание на расположение программы в памяти
            ENTRY                               ; Указание на точку входа в программу
            ALIGN                               ; Выровнять по слову (4 байта)

Reset_Handler

            ; Цикл копирования отрицательных чисел
            LDR   R0, =0x20000000   ; Адрес массива источника
            LDR   R1, =0x20000020   ; Адрес массива приемника
            LDR   R2, =(0x20000010 - 0x20000000 + 1) ; Количество элементов (счетчик цикла)
            LDR   R3, =0x00000080   ; Маска бита знака
Loop_Neg
            LDRB  R4, [R0]          ; Загрузить элемент в R4
            TST   R4, R3            ; Проверить знак элемента
            BEQ   Positive          ; Переход по метке если число положительное или ноль
            EORS  R4, R4, R3        ; Сброс флага знака
            RSBS  R4, R4, #0        ; Получение дополнительного кода 0 - R4
            STRB  R4, [R1]          ; Сохранение R4 в массиве приемнике
            ADDS  R1, #1            ; Увеличение адреса приемника на 1
Positive    ADDS  R0, #1            ; Увеличение адреса источника на 1
            SUBS  R2, R2, #1        ; Уменьшение счетчика цикла на 1
            BNE   Loop_Neg          ; Переход если не ноль

            ; Цикл копирования положительных чисел
            LDR   R0, =0x20000000   ; Адрес массива источника
            LDR   R2, =(0x20000010 - 0x20000000) ; Количество элементов (счетчик цикла)
Loop_Pos
            LDRB  R4, [R0]          ; Загрузить элемент в R4
            TST   R4, R3            ; Проверить знак элемента
            BNE   Negative          ; Переход по метке если число отрицательное
            CMP   R4, #0            ; Сравнить с нулем
            BEQ   Zero              ; Переход по метке если ноль
            STRB  R4, [R1]          ; Сохранение R4 в массиве приемнике
            ADDS  R1, #1            ; Увеличение адреса приемника на 1
Negative
Zero
            ADDS  R0, #1            ; Увеличение адреса источника на 1
            SUBS  R2, R2, #1        ; Уменьшение счетчика цикла на 1
            BNE   Loop_Pos          ; Переход если не ноль

Stop
            B     Stop              ; Бесконечный цикл

            ALIGN                   ; Выровнять по слову (4 байта)

            ; Секция с таблицей векторов прерываний.
            AREA    RESET, DATA, READONLY ; Указание на расположение векторов прерываний
            EXPORT  Vectors         ; Экспорт метки Vectors для компоновщика
Vectors
            DCD     0x20004000      ; Начало стека (последний адрес ОЗУ)
            DCD     Reset_Handler   ; Вектор сброса (начало программы)

            END                     ; Команда транслятору об окончании текста программы