/**
  ******************************************************************************
  * \file    main.c
  * \author  Александр Смирнов
  * \version 1.0.0
  * \date    1.02.2022
  * \brief   Программа на языке C для учебного стенда на базе
  *          STM32F072RBT6 в среде разработки Keil uVision 5.
  *          Подключение библиотек поддержки МК STM32F072RBT6 осуществляется
  *          средствами IDE Keil через Run-Time Enviroment (RTE).
  *          Программа включает светодиод LED1.
  *          Программа работает в режиме 0 учебного стенда (S1 = 0, S2 = 0).
  ******************************************************************************
  */

/* В этой программе используется обращение к регистра специальных фукнций
   по абсолютным адресам вместо библиотеки CMSIS. */

/* Обращение к регистру разрешения тактирования
   AHB peripheral clock enable register (RCC_AHBENR) через указатель */
#define RCC_AHBENR      (*((volatile unsigned int *)(0x40021000 + 0x14)))

/* Обращение к регистру режима порта C
   GPIO port mode register (MODER) через указатель */
#define GPIOC_MODER     (*((volatile unsigned int *)(0x48000800 + 0x00)))

/* Обращение к регистру выходных данных порта C
   GPIO port output data register (ODR) через указатель */
#define GPIOC_ODR       (*((volatile unsigned int *)(0x48000800 + 0x14)))

/* Функция main - точка входа в программу. */
int main(void)
{
    /* Инициализация периферийных модулей. */

    /* Включение тактирования модулей. */
    RCC_AHBENR = RCC_AHBENR | 0x00080000;

    /* Настройка на вывод линии PC0 (LED1) */
    GPIOC_MODER = GPIOC_MODER | 0x00000001;

    /* Включить светодиод PC0 (LED1). */
    GPIOC_ODR = GPIOC_ODR & 0xFFFFFFFE;

    /* Бесконечный цикл. */
    while (1)
    {
    }
}
