; \file    main.s
; \author  Александр Смирнов
; \version 1.0.0
; \date    15.09.2022
; \brief   Программа на языке Ассемблер (ARM) для среды разработки Keil uVision 5.
;          Задача:
;          Дан массив 2-х байтовых слов в прямом коде со знаком.
;          Начальный адрес массива – 0x20000000. Количество элементов – 5.
;          Начиная с адреса 0x20000020 создать новый массив,
;          переписав в него только отрицательные элементы исходного массива,
;          представив их в дополнительном коде со знаком.

            ; Секция с программой
            ; Обязательная секция
            AREA    PROGRAM, CODE, READONLY     ; Указание на расположение программы в памяти
            ENTRY                               ; Указание на точку входа в программу
            ALIGN                               ; Выровнять по слову (4 байта)

Reset_Handler

            LDR   R0, =0x20000000   ; Адрес массива источника
            LDR   R1, =0x20000020   ; Адрес массива приемника
            LDR   R2, =5            ; Количество элементов (счетчик цикла)
            LDR   R3, =0x00008000   ; Маска бита знака

Loop
            LDRH  R4, [R0]          ; Загрузить элемент в R4
            TST   R4, R3            ; Проверить знак элемента
            BEQ   Positive          ; Переход по метке если число положительное
            EORS  R4, R4, R3        ; Сброс флага знака
            RSBS  R4, R4, #0        ; Получение дополнительного кода 0 - R4
            STRH  R4, [R1]          ; Сохранение R4 в массиве приемнике
            ADDS  R1, #2            ; Увеличение адреса приемника на 2
Positive    ADDS  R0, #2            ; Увеличение адреса источника на 2

            SUBS  R2, R2, #1        ; Уменьшение счетчика цикла на 1
            BNE   Loop              ; Переход если не ноль

Stop
            B     Stop              ; Бесконечный цикл


            ; Секция с таблицей векторов прерываний.
            ; Этот секция обязательна. Без него программа не будет
            ; компилироваться.
            AREA    RESET, DATA, READONLY ; Указание на расположение векторов прерываний
            EXPORT  Vectors         ; Экспорт метки Vectors для компоновщика
Vectors
            DCD     0x20004000      ; Начало стека (последний адрес ОЗУ)
            DCD     Reset_Handler   ; Вектор сброса (начало программы)

            END                     ; Команда транслятору об окончании текста программы