/**
  ******************************************************************************
  * \file    gpio_cmsis.c
  * \author  Александр Смирнов
  * \version 1.0.1
  * \date    25.02.2023
  * \brief   Программа на языке C для учебного стенда на базе
  *          STM32F072RBT6 в среде разработки Keil uVision 5.
  *          Подключение библиотек поддержки МК STM32F072RBT6 осуществляется
  *          средствами IDE Keil через менеджер пакетов Run-Time Environment (RTE).
  *          Программа включает светодиод D1.
  *          Программа работает в режиме 0 учебного стенда (S1 = 0, S2 = 0).
  ******************************************************************************
  */

/* Подключение заголовочного файла с макроопределениями всех регистров специальных
   функций МК STM32F072RBT6. Описание содержит адреса регистров, маски и смещения.
   Имена макроопределений соответствует именам в техническом описании (Datasheet
   и Reference Manual).
   Пример такого макроопределения - GPIOC. Если его раскрыть (через множество
   промежуточных макроопределений) то это будет не что иное как абсолютный адрес
   начала регистров специальных функций порта C. Обращаясь к этому адресу
   со смещением (здесь это реализовано через структуры, например GPIOC->ODR)
   можно обращаться к любому регистру этого порта.
   Данные описания входят в библиотеку Cortex-M -
   Common Microcontroller Software Interface Standard (CMSIS).
   Все современные МК с процессором Cortex-M имеют подобное описание.
   Для подключения заголовочно файла необходимо использовать директиву #include */
#include <stm32f0xx.h>

/* Функция main - точка входа в программу. */
int main(void)
{
    /* Инициализация периферийных модулей. */

    /* Включение тактирования модулей.
       Эту строку можно написать аналогичным образом:
       RCC->AHBENR = RCC->AHBENR | RCC_AHBENR_GPIOCEN;
       Макроопределение RCC_AHBENR_GPIOCEN находится файле stm32f0xx.h и означает также 0x00080000.
       Такие макроопределения позволяют перейти от чисел к осмысленным названиям.
    */
    RCC->AHBENR = RCC->AHBENR | 0x00080000;

    /* Настройка на вывод линии PC0 (D1).
       Эту строку можно написать аналогичный образом:
       GPIOC->MODER = GPIOC->MODER | GPIO_MODER_MODER0_0;
       Макроопределение GPIO_MODER_MODER0_0 находится файле stm32f0xx.h и означает также 0x00000001 */
    GPIOC->MODER = GPIOC->MODER | 0x00000001;

    /* Включить светодиод PC0 (D1). */
    GPIOC->ODR = GPIOC->ODR | 0x00000001;

    /* Бесконечный цикл. */
    while (1)
    {
    }
}
