; \file    main.s
; \author  Александр Смирнов
; \version 1.0.0
; \date    18.09.2022
; \brief   Программа на языке Ассемблер (ARM) для среды разработки Keil uVision 5.
;          Задача: Загрузить число из памяти по адресу 0x20000000,
;          прибавить к этому числу 200 и сохранить результат по адресу 0x20000020.

            ; Микроконтроллер STM32F072RBT6
            ; ОЗУ
            ; Адрес начала: 0x20000000
            ; Объем: 0x4000 байт (16 Кбайт)
            ; ПЗУ
            ; Адрес начала: 0x08000000
            ; Объем: 0x20000 байт (128 Кбайт)

            ; Секция с программой
            ; Обязательная секция
            AREA    PROGRAM, CODE, READONLY     ; Указание на расположение программы в памяти
            ENTRY                               ; Указание на точку входа в программу
            ALIGN                               ; Выровнять по слову (4 байта)

Reset_Handler
            ; Команды программы располагаются с этого места и до метки Stop

            ; НАЧАЛО ПРОГРАММЫ
            LDR   R0, =0x20000000   ; Загрузить адрес 0x20000000 в R0
            LDR   R1, [R0]          ; Загрузить в R1 содержимое по адресу в R0
            MOVS  R2, #200          ; Загрузить в R2 числов 200
            ADDS  R1, R1, R2        ; Сложить R1 и R2, результат поместить в R1
            LDR   R0, =0x20000020   ; Загрузить адрес 0x20000020 в R0
            STR   R1, [R0]          ; Сохранить R1 по адресу из R0
            ; КОНЕЦ ПРОГРАММЫ

            ; Программа останавливается здесь
Stop
            B      Stop             ; Бесконечный цикл

            ALIGN                               ; Выровнять по слову (4 байта)

            ; Секция с таблицей векторов прерываний.
            ; Этот секция обязательна. Без нее программа не будет компилироваться.
            AREA    RESET, DATA, READONLY ; Указание на расположение векторов прерываний
            EXPORT  Vectors         ; Экспорт метки Vectors для компоновщика
Vectors
            DCD     0x20004000      ; Начало стека (последний адрес ОЗУ)
            DCD     Reset_Handler   ; Вектор сброса (начало программы)

            END                     ; Команда транслятору об окончании текста программы