/**
  ******************************************************************************
  * \file    main.c
  * \author  Александр Смирнов
  * \version 1.0.0
  * \date    4.02.2023
  * \brief   Программа на языке C для учебного стенда на базе
  *          STM32F072RBT6 в среде разработки Keil uVision 5.
  *          Подключение библиотек поддержки МК STM32F072RBT6 осуществляется
  *          средствами IDE Keil через менеджер пакетов Run-Time Environment (RTE).
  *          В программе показано использование указателей (адресов).
  ******************************************************************************
  */

void add2(int n)
{
    n = n + 2;
}

void add2_ptr(int* n)
{
    *n = *n + 2;
}

void reverse(int a[], int n)
{
    for (int i = 0; i < n/2; i++)
    {
        int tmp = a[i];
        a[i] = a[n - i - 1];
        a[n - i - 1] = tmp;
    }
}

/* Функция main - точка входа в программу. */
int main(void)
{
    /* Объявление и инициализация переменных. */
    int a = 1;

    /* Объявление указателя. */
    int *pa;

    /* Присваивание указателю pa адреса переменной а. */
    pa = &a;

    /* Обращение к переменной a через указатель pa. */
    *pa = 4;

    /* Первая функция принимает аргумент по значению и не изменяет
    состояние этой переменной, вторая функция принимает аргумент через
    указатель и изменяет значение аргумента*/
    add2(a);
    add2_ptr(&a);

    int arr[5] = {1, 2, 3, 4, 5};

    /* Массивы передаются по указателю (по адресу).
       Поэтому функция может изменять содержимое массива. */
    reverse(arr, 5);
}
