; Шаблон программы на языке ARM ассемблер и проекта для IDE Keil uVision 5.

; Секция с константами
; Здесь располагаются константы
; Необязательная секция
            AREA    CONST, DATA, READONLY       ; Указание на расположение констант в памяти
myconst     DCD     0xAA                        ; myconst = 0xAA


; Секция с переменными
; Здесь располагаются переменные
; Необязательная секция
            AREA    RWDATA, DATA, READWRITE     ; Указание на расположение переменных в памяти
mydata      DCD     43                          ; mydata = 43


; Макроопределения компилятора
mydef       EQU     10                          ; Вместо строки `mydef` компилятор будет
                                                ; подставлять число 10


; Секция с программой
; Обязательная секция
            AREA    PROGRAM, CODE, READONLY     ; Указание на расположение программы в памяти
            ENTRY
            ALIGN

Reset_Handler
            ; Команды программы располагаются с этого места и до метки STOP
            ; Вместо примеров команд следует располагать вашу программу

            ; НАЧАЛО ПРОГРАММЫ
            ; Пример программы копирования константы myconst
            ; в ячейку памяти mydata
            LDR     R0, =myconst
            LDR     R1, [R0]
            LDR     R2, =mydata
            STR     R1, [R2]

            ; Пример программы копирования mydef
            ; в ячейку памяти mydata + 4
            LDR     R0, =mydef
            ADDS    R2, R2, #4
            STR     R0, [R2]
            ; КОНЕЦ ПРОГРАММЫ

            ; Программа останавливается здесь
STOP
            B  STOP             ; Бесконечный цикл


; Секция с таблицей векторов прерываний.
; Этот секция обязательна. Без него программа не будет
; компилироваться.
            AREA    RESET, DATA, READONLY ; Указание на расположение векторов прерываний
            EXPORT  __Vectors   ; Метка __Vectors экспортируется из файла компоновщика
__Vectors
            DCD     0x20004000     ; Начало стека
            DCD     Reset_Handler  ; Вектор сброса

            END                    ; Команда транслятору об окончании текста программы