/**
  ******************************************************************************
  * \file    main.c
  * \author  Александр Смирнов
  * \version 1.0.0
  * \date    1.01.2022
  * \brief   Шаблон программы на языке C и проекта связки инструметов vscode и gcc.
  *          Проект полностью настроен для учебного стенда и содержит
  *          простейшую программу управления одним светодиодом.
  *          В верхнем положении ключа SW1 включается светодиод D1,
  *          в нижнем светодиод D1 выключается.
  *          Программа работает в режиме 0 учебного стенда (S1 = 0, S2 = 0).
  ******************************************************************************
  */

/* Подключение заголовочного файле с макроопределениями всех регистров специальных
   функций МК STM32F072RBT6. Описание содержит адреса регистров, маски, смещения.
   Имена макроопределений соотвествует именам в техническом описании (Datasheet
   и Reference Manual). Кроме того, подключаются функции CMSIS. */
#include <stm32f0xx.h>

/* Функция main - точка входа в программу */
int main(void)
{
    /* Инициализация периферийных модулей */

    /* Включение тактирования модулей */
    RCC->AHBENR |= RCC_AHBENR_GPIOAEN; /* Включение тактирования порта A */
    RCC->AHBENR |= RCC_AHBENR_GPIOCEN; /* Включение тактирования порта C */

    /* Настройка на вывод линии PC0 (D1) */
    GPIOC->MODER |= GPIO_MODER_MODER0_0;

    /* Включение подтягивающего резистора линии PA11 (SW1) */
    GPIOA->PUPDR |= GPIO_PUPDR_PUPDR11_0;

    /* Бесконечный цикл */
    while (1)
    {
        /* Чтение состояние линии PA11 (SW1) и исполнение ветви в зависимости от состояния */
        if (GPIOA->IDR & (1 << 11))
        {
            /* Включить светодиод PC0 (D1) */
            GPIOC->ODR |= (1 << 0);
        }
        else
        {
            /* Выключить светодиод PC0 (D1) */
            GPIOC->ODR &= ~(1 << 0);
        }
    }
}
