/**
  ******************************************************************************
  * \file    main.c
  * \author  Александр Смирнов
  * \version 1.0.0
  * \date    3.02.2023
  * \brief   Пример программа для лабораторной работы №1 на языке C
  *          для учебного стенда на базе STM32F072RBT6
  *          в среде разработки Keil uVision 5.
  *          В программе показан основы синтаксиса языка C.
  ******************************************************************************
  */


/* Функция main - точка входа в программу.
   В любой программе на языке C должна быть одна функция main.
   В ней начинается исполнение программы. */
int main(void)
{

}
